Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Function type parameters with the escaping type attribute require explicit use of self. for properties or methods.
ja: escaping型属性を持つ関数型パラメーターは、明示的なself.の使用をプロパティやメソッドに対して必要とします。

source: Function types that can throw or rethrow an error must be marked with the throws keyword.
ja: エラーをスローまたは再スローできる関数型は、throwsキーワードで印されなければなりません。

source: Functions
ja: 関数

source: Functions With Multiple Parameters
ja: 複数のパラメーターを持つ関数

source: Functions With an Implicit Return
ja: 暗黙的なreturnをもつ関数

source: Functions Without Parameters
ja: パラメータのない関数

source: Functions Without Return Values
ja: 戻り値のない関数

source: Functions and Closures
ja: 関数とクロージャ

source: Functions and closures that are defined inside an inlinable function are implicitly inlinable, even though they can’t be marked with this attribute.
ja: インライン可能関数内部で定義される関数とクロージャは、暗黙的にインライン可能です。

source: Functions and methods that can throw an error must be marked with the throws keyword.
ja: エラーをスローできる関数とメソッドは、throwsキーワードで印されなければなりません。

source: Functions and methods with the Never return type are called nonreturning.
ja: Never戻り型を持つ関数およびメソッドは、非復帰と呼ばれます。

source: Functions are a first-class type.
ja: 関数は、第一級（ファーストクラス）の種類のものです。

source: Functions are actually a special case of closures: blocks of code that can be called later.
ja: 関数は、実際のところクロージャ：後刻に呼び出されることができるコードのひとまとまり、の特別な場合です。

source: Functions are not required to define a return type.
ja: 関数は、戻り型を定義することを要求されません。

source: Functions are not required to define input parameters.
ja: 関数は、入力パラメータを定義することを要求されません。

source: Functions can also be written within other functions to encapsulate useful functionality within a nested function scope.
ja: 関数は、また、他の関数の内部で記述されることで、役に立つ機能性を入れ子にされた関数スコープ内でカプセル化することができます。

source: Functions can be nested.
ja: 関数は、入れ子にされることができます。

source: Functions can have multiple input parameters, which are written within the function’s parentheses, separated by commas.
ja: 関数は複数の入力パラメータを持つことが出来ます、それは関数の丸括弧内に書かれ、コンマで区切られます。

source: Functions can return multiple values using a tuple type as the return type of the function.
ja: 関数は、関数の戻り型としてタプル型を使って、複数の値を返すことができます。

source: Functions that Never Return
ja: 決して返らない関数

source: Functions that return an opaque type require the Swift 5.1 runtime.
ja: 不透明型を返す関数は、スウィフト5.1ランタイムを必要とします。

source: Functions with Multiple Return Values
ja: 複数の戻り値を持つ関数

source: Functions without a defined return type return a special value of type Void.
ja: 戻り型定義のない関数は、型Voidの特別な値を返します。

source: Fundamental Set Operations
ja: 集合演算の基本

source: Furthermore, a new CreditCard instance can only be created by passing a number value and a customer instance to a custom CreditCard initializer.
ja: さらに、新しいCreditCardインスタンスは、number値とcustomerインスタンスをあつらえのCreditCardイニシャライザに渡すことによってのみ作成されることができます。

source: Future versions of the library can’t change the declaration by adding, removing, or reordering an enumeration’s cases or a structure’s stored instance properties.
ja: ライブラリの将来のバージョンは、追加、削除、または列挙のもつケース節や構造体のもつ格納インスタンスプロパティの再配列によって宣言を変更できません。

source: Generally speaking, protocol types give you more flexibility about the underlying types of the values they store, and opaque types let you make stronger guarantees about those underlying types.
ja: 一般的に言えば、プロトコル型はそれらが格納する値の基礎をなす型についてあなたにより柔軟性を与えます、そして不透明型はそれらの基礎をなす型についてあなたにより確固とした保証をさせます。

source: Generic Argument Clause
ja: 総称体引数節

source: Generic Functions
ja: 総称体関数

source: Generic Parameter Clause
ja: 総称体パラメータ節

source: Generic Parameters and Arguments
ja: 総称体パラメータと引数

source: Generic Subscripts
ja: 総称体添え字

source: Generic Types
ja: 総称体型

source: Generic Where Clauses
ja: 総称体where節

source: Generic classes can inherit from other generic and nongeneric classes, but a nongeneric class can inherit only from other nongeneric classes.
ja: 総称体クラスは、他の総称体および非総称体クラスから継承することができます、しかし非総称体クラスはただ他の非総称体クラスからのみ継承することができます。

source: Generic code enables you to write such a function.
ja: 総称体コードは、あなたにこのような関数を書くことを可能にします。

source: Generic types let the code that calls a function pick the type for that function’s parameters and return value in a way that’s abstracted away from the function implementation.
ja: 総称体型は、ある関数を呼び出すコードに、その関数のもつパラメータと戻り値に対する型を、関数実装から離れて抽象化されるある方法で選択させます。

source: Generics
ja: 総称体

source: Generics are one of the most powerful features of Swift, and much of the Swift standard library is built with generic code.
ja: 総称体は、スウィフトの最も強力な特徴のうちの１つです、そして、多くのスウィフト標準ライブラリは総称体コードで組み立てられます。

source: Gettable and settable properties are indicated by writing { get set } after their type declaration, and gettable properties are indicated by writing { get }.
ja: 取得可能かつまた設定可能なプロパティは、それらの型宣言の後に{ get set }を書くことによって示されます、そして取得可能なプロパティは{ get }を書くことによって示されます。

source: Getters and Setters
ja: ゲッターとセッター

source: Getters and setters for constants, variables, properties, and subscripts automatically receive the same access level as the constant, variable, property, or subscript they belong to.
ja: 定数、変数、プロパティ、そして添え字のためのゲッターとセッターは、自動的に、それらが属している定数、変数、プロパティまたは添え字と同じアクセス水準を受けます。

source: Give enumeration types singular rather than plural names, so that they read as self-evident:
ja: 列挙型に複数形よりむしろ単数形の名前を与えてください、わかりきったことという印象を受けるので：

source: Give properties and methods lowerCamelCase names (such as frameRate and incrementCount) to differentiate them from type names.
ja: プロパティとメソッドにlowerCamelCase ローワーキャメルケース名（例えばframeRateやincrementCountなど）を与えて、それらを型名と区別するようにしてください。

source: Give types UpperCamelCase names (such as SomeStructure and SomeClass here) to match the capitalization of standard Swift types (such as String, Int, and Bool).
ja: それら型にUpperCamelCase アッパーキャメルケース名（ここでのSomeStructureやSomeClassのような）を与えて、標準のスウィフト型（例えばString、Int、そしてBoolなど）の大文字の使用法に合わせてください。

source: Global and Local Variables
ja: グローバルおよびローカル変数

source: Global and nested functions, as introduced in Functions, are actually special cases of closures.
ja: 関数で紹介される、グローバルおよび入れ子にされた関数は、実際にはクロージャの特別な場合です。

source: Global constants and variables are always computed lazily, in a similar manner to Lazy Stored Properties.
ja: グローバルな定数と変数は、遅延格納プロパティと似たやり方で、常に遅延計算されます。

source: Global functions are closures that have a name and do not capture any values.
ja: グローバルな関数は、名前を持ち、まったく値をキャプチャしない（捕獲しない）クロージャです。

source: Global variables are variables that are defined outside of any function, method, closure, or type context.
ja: グローバルな変数は、あらゆる関数、メソッド、クロージャ、または型の文脈の外で定義される変数です。

source: Grammar of a Self type
ja: Self型の文法

source: Grammar of a binary expression
ja: 二項式の文法

source: Grammar of a branch statement
ja: 分岐文の文法

source: Grammar of a break statement
ja: ブレーク文の文法

source: Grammar of a class declaration
ja: クラス宣言の文法

source: Grammar of a closure expression
ja: クロージャ式の文法

source: Grammar of a code block
ja: コードブロックの文法

source: Grammar of a compile-time diagnostic statement
ja: コンパイル時診断文の文法

source: Grammar of a compiler control statement
ja: コンパイラ制御文の文法

source: Grammar of a conditional compilation block
ja: 条件コンパイルブロックの文法

source: Grammar of a conditional operator
ja: 条件演算子の文法

source: Grammar of a constant declaration
ja: 定数宣言の文法

source: Grammar of a continue statement
ja: 継続文の文法

source: Grammar of a control transfer statement
ja: 制御移動文の文法

source: Grammar of a declaration
ja: 宣言の文法

source: Grammar of a declaration modifier
ja: 宣言修飾子の文法

source: Grammar of a defer statement
ja: defer文の文法

source: Grammar of a deinitializer declaration
ja: デイニシャライザ宣言の文法

source: Grammar of a dictionary type
ja: 辞書型の文法

source: Grammar of a do statement
ja: do文の文法

source: Grammar of a fallthrough statement
ja: フォールスルー文の文法

source: Grammar of a floating-point literal
ja: 浮動小数点リテラルの文法

source: Grammar of a for-in statement
ja: for-in文の文法

source: Grammar of a forced-value expression
ja: 強制された値の式の文法

source: Grammar of a function call expression
ja: 関数呼び出し式の文法

source: Grammar of a function declaration
ja: 関数宣言の文法

source: Grammar of a function type
ja: 関数型の文法

source: Grammar of a generic argument clause
ja: 総称体引数節の文法

source: Grammar of a generic parameter clause
ja: 総称体パラメータ節の文法

source: Grammar of a getter-setter block
ja: ゲッターセッター・ブロックの文法

source: Grammar of a guard statement
ja: guard文の文法

source: Grammar of a implicit member expression
ja: 暗黙的メンバー式の文法

source: Grammar of a key-path expression
ja: キーパス式の文法

source: Grammar of a key-path string expression
ja: キーパス文字列式の文法

source: Grammar of a labeled statement
ja: ラベルをつけられた文の文法

source: Grammar of a line control statement
ja: 行制御文の文法

source: Grammar of a literal
ja: リテラルの文法

source: Grammar of a literal expression
ja: リテラル式の文法

source: Grammar of a loop statement
ja: ループ文の文法

source: Grammar of a metatype type
ja: メタタイプ型の文法

source: Grammar of a parenthesized expression
ja: 丸括弧に入れられた式の文法

source: Grammar of a pattern
ja: パターンの文法

source: Grammar of a postfix expression
ja: 接尾辞式の文法

source: Grammar of a postfix self expression
ja: 接尾辞self式の文法

source: Grammar of a precedence group declaration
ja: 優先順位グループ宣言の文法

source: Grammar of a prefix expression
ja: 接頭辞式の文法

source: Grammar of a primary expression
ja: 基本式の文法

source: Grammar of a protocol associated type declaration
ja: プロトコル関連型宣言の文法

source: Grammar of a protocol composition type
ja: プロトコル合成型の文法

source: Grammar of a protocol declaration
ja: プロトコル宣言の文法

source: Grammar of a protocol initializer declaration
ja: プロトコル・イニシャライザ宣言の文法

source: Grammar of a protocol method declaration
ja: プロトコルメソッド宣言の文法

source: Grammar of a protocol property declaration
ja: プロトコルプロパティ宣言の文法

source: Grammar of a protocol subscript declaration
ja: プロトコル添え字宣言の文法

source: Grammar of a repeat-while statement
ja: repeat-while文の文法

source: Grammar of a return statement
ja: return文の文法

source: Grammar of a selector expression
ja: セレクタ式の文法

source: Grammar of a self expression
ja: self式の文法

source: Grammar of a statement
ja: 文の文法

source: Grammar of a string literal
ja: 文字列リテラルの文法

source: Grammar of a structure declaration
ja: 構造体宣言の文法

source: Grammar of a subscript declaration
ja: 添え字宣言の文法

source: Grammar of a subscript expression
ja: 添え字式の文法

source: Grammar of a superclass expression
ja: スーパークラス式の文法

source: Grammar of a switch statement
ja: switch文の文法

source: Grammar of a throw statement
ja: スロー文の文法

source: Grammar of a top-level declaration
ja: トップレベル宣言の文法

source: Grammar of a try expression
ja: try式の文法

source: Grammar of a tuple expression
ja: タプル式の文法

source: Grammar of a tuple pattern
ja: タプル・パターンの文法

source: Grammar of a tuple type
ja: タプル型の文法

source: Grammar of a type
ja: 型の文法

source: Grammar of a type alias declaration
ja: 型エイリアス宣言の文法

source: Grammar of a type annotation
ja: 型注釈の文法

source: Grammar of a type casting pattern
ja: 型キャスト・パターンの文法

source: Grammar of a type identifier
ja: 型識別子の文法

source: Grammar of a type inheritance clause
ja: 型継承節の文法

source: Grammar of a type-casting operator
ja: 型キャスト演算子の文法

source: Grammar of a value-binding pattern
ja: 値束縛パターンの文法

source: Grammar of a variable declaration
ja: 変数宣言の文法

source: Grammar of a while statement
ja: while文の文法

source: Grammar of a wildcard expression
ja: ワイルドカード式の文法

source: Grammar of a wildcard pattern
ja: ワイルドカード・パターンの文法

source: Grammar of an array type
ja: 配列型の文法

source: Grammar of an assignment operator
ja: 代入演算子の文法

source: Grammar of an attribute
ja: 属性の文法

source: Grammar of an availability condition
ja: 有効性条件の文法

source: Grammar of an enumeration case pattern
ja: 列挙ケース節パターンの文法

source: Grammar of an enumeration declaration
ja: 列挙宣言の文法

source: Grammar of an explicit member expression
ja: 明示的メンバー式の文法

source: Grammar of an expression
ja: 式の文法

source: Grammar of an expression pattern
ja: 式パターンの文法

source: Grammar of an extension declaration
ja: 拡張宣言の文法

source: Grammar of an identifier
ja: 識別子の文法

source: Grammar of an identifier pattern
ja: 識別子パターンの文法

source: Grammar of an if statement
ja: if文の文法

source: Grammar of an implicitly unwrapped optional type
ja: 暗黙的にアンラップされるオプショナル型の文法

source: Grammar of an import declaration
ja: インポート宣言の文法

source: Grammar of an initializer declaration
ja: イニシャライザ宣言の文法

source: Grammar of an initializer expression
ja: イニシャライザ式の文法

source: Grammar of an integer literal
ja: 整数リテラルの文法

source: Grammar of an opaque type
ja: 不透明型の構文

source: Grammar of an operator declaration
ja: 演算子宣言の文法

source: Grammar of an optional pattern
ja: オプショナルパターンの文法

source: Grammar of an optional type
ja: オプショナル型の文法

source: Grammar of an optional-chaining expression
ja: オプショナル連鎖式の文法

source: Grammar of operators
ja: 演算子の文法

source: Grammar of whitespace
ja: 空白の文法

source: Greater than (a > b)
ja: より大きい (a > b)

source: Greater than or equal to (a >= b)
ja: より大きいか等しい、以上 (a >= b)

source: Greet n times
ja: （n回あいさつします）

source: Grouping parentheses don’t change an expression’s type—for example, the type of (1) is simply Int.
ja: グループ化括弧はある式のもつ型を変えません — 例えば、(1)の型は単にIntです。

source: Guard Statement
ja: guard文

source: Guiding Principle of Access Levels
ja: アクセス水準の原理指針

source: Half-Open Range Operator
ja: 半開範囲演算子

source: Half-open ranges are particularly useful when you work with zero-based lists such as arrays, where it’s useful to count up to (but not including) the length of the list:
ja: 半開範囲は、あなたが配列のようなゼロに基づくリストを扱うとき特に便利です、そこにおいて、そのリストの長さまで（しかしそれは含まずに）数え上げるのに役に立ちます：

source: Handling Errors
ja: エラーを処理する

source: Handling Errors Using Do-Catch
ja: do-catchを使ってエラーを処理する

source: Hash Values for Set Types
ja: Set型のためのハッシュ値

source: Having created a new Vehicle instance, you can access its description property to print a human-readable description of the vehicle’s current speed:
ja: 新しいVehicleインスタンスを作成したら、あなたはそれのdescriptionプロパティにアクセスして、その乗り物の現在速度の説明を人の読めるように出力することが出来ます：

source: Here are two classes, Circle and Country, both of which conform to the HasArea protocol:
ja: その両方ともHasAreaプロトコルに従う２つのクラス、CircleとCountryが、ここにあります：

source: Here is the general form of a do-catch statement:
ja: ここにdo-catch文の一般的な形式があります：

source: Here the function returns an integer, so x and y are optional integers.
ja: ここに整数を返す関数があります、それでxとyはオプショナル整数です。

source: Here, $0 and $1 refer to the closure’s first and second String arguments.
ja: ここでは、$0と$1は、クロージャの１番目と２番目のString引数に言及します。

source: Here, AudioSample is defined as an alias for UInt16.
ja: ここでは、AudioSampleはUInt16に対するエイリアス（別名）として定義されます。

source: Here, self disambiguates between a method parameter called x and an instance property that is also called x:
ja: ここでは、selfは、xと呼ばれるメソッドパラメータと同様にまたxと呼ばれるインスタンスプロパティの間の曖昧さをなくします：

source: Here, a new array called breakfastList is created from an array literal containing three new ShoppingListItem instances.
ja: ここでは、breakfastListと呼ばれる新しい配列は、３つの新しいShoppingListItemインスタンスを含んでいる配列リテラルからつくられます。

source: Here, an additional if statement was added to respond to particularly warm temperatures.
ja: ここでは、追加のif文は、特に暖かい気温に反応するために加えられました。

source: Here, the favoriteGenres set is initialized with three String values ("Rock", "Classical", and "Hip hop"), written within an array literal.
ja: ここでは、favoriteGenres集合は、配列リテラル内に書かれる、３つのString値（"Rock"、"Classical"、そして"Hip hop"）で初期化されます。

source: Here, the shoppingList array is initialized with two String values ("Eggs" and "Milk"), written within an array literal.
ja: ここで、shoppingList配列は、配列リテラル内に書かれる２つのString値（"Eggs"と"Milk"）で初期化されます。

source: Here, the deinitializer simply returns all of the player’s coins to the bank:
ja: ここでは、デイニシャライザは単に胴元にプレーヤーのコインの全てを返します：

source: Here, the function type of the sorted(by:) method’s argument makes it clear that a Bool value must be returned by the closure.
ja: ここでは、sorted(by:)メソッドの引数である関数型は、Bool値がクロージャによって返されなければならないことを明白にします。

source: Here, the player has won 2,000 coins.
ja: ここでは、プレーヤーは2,000個のコインを獲得しました。

source: Here, the possibility that increment(forCount:) might not be implemented is also handled by optional chaining.
ja: ここでは、increment(forCount:)が実装されないかもしれないという可能性もまたオプショナル連鎖によって取り扱われます。

source: Here, the raw values for an enumeration called ASCIIControlCharacter are defined to be of type Character, and are set to some of the more common ASCII control characters.
ja: ここでは、ASCIIControlCharacterと呼ばれる列挙に対する生の値は、型Characterであると定義されて、たいへんありふれたASCII制御文字のいくつかに設定されます。

source: Here, the superclass has a single designated initializer and two convenience initializers.
ja: ここでは、スーパークラスは１つの指定イニシャライザと２つの便宜イニシャライザを持ちます。

source: Here, the value of the constant three is used to create a new value of type Double, so that both sides of the addition are of the same type.
ja: ここでは、定数threeの値が、Double型の新しい値をつくるために使われます、それでこの加算の両側は同じ型です。

source: Here, they are used to print the categorization of the point.
ja: ここでは、それらはポイントの分類を出力するために使われます。

source: Here’s a class called Animal, which doesn’t conform to the HasArea protocol:
ja: HasAreaプロトコルに従わないAnimalと呼ばれるクラスが、ここにあります：

source: Here’s a function called chooseStepFunction(backward:), whose return type is (Int) -> Int.
ja: ここにchooseStepFunction(backward:)と呼ばれる関数があります、それの戻り型は(Int) -> Intです。

source: Here’s a function with no input parameters, which always returns the same String message whenever it is called:
ja: ここに入力パラメータのない関数があります、そしてそれは、それが呼ばれるときはいつでも、常に同じStringメッセージを返します：

source: Here’s a generic version of the swapTwoInts(_:_:) function from above, called swapTwoValues(_:_:):
ja: ここに、上記のswapTwoInts(_:_:)関数の総称体版があります、それはswapTwoValues(_:_:)と呼ばれます：

source: Here’s a generic version of the same code:
ja: 同じコードの総称体版は、ここにあります：

source: Here’s a more complex class, which also adopts and conforms to the FullyNamed protocol:
ja: また、FullyNamedプロトコルを採用して準拠するさらに複雑なクラスが、ここにあります：

source: Here’s a more complex data source called TowardsZeroSource, which makes a Counter instance count up or down towards zero from its current count value:
ja: TowardsZeroSourceと呼ばれるより複雑なデータ・ソースがここにあります、それは、Counterインスタンスをその現在のcount値から上下にゼロの方へ数えます：

source: Here’s a nongeneric function called findIndex(ofString:in:), which is given a String value to find and an array of String values within which to find it.
ja: ここにfindIndex(ofString:in:)と呼ばれる非総称体関数があります、それは、見つけるString値と、そこにおいてそれを捜すString値からなる配列を与えられます。

source: Here’s a simple CounterDataSource implementation where the data source returns a constant value of 3 every time it’s queried.
ja: ある単純なCounterDataSource実装がここにあります、そこにおいて、データ・ソースは3の定数値をそれが問い合わされるたびに返します。

source: Here’s a skeleton outline of how a closure can be used to provide a default property value:
ja: ここに、あるクロージャが省略時のプロパティ値を提供するために使われることができる方法の骨組み概要があります：

source: Here’s a standard, nongeneric function called swapTwoInts(_:_:), which swaps two Int values:
ja: ここに、通常の、非総称体のswapTwoInts(_:_:)と呼ばれる関数があります、それは、２つのInt値を交換します：

source: Here’s a structure that stores a small rectangle, using the same (rather arbitrary) definition of “small” that’s implemented by the TwelveOrLess property wrapper:
ja: ここにある構造体があります、それは小さな矩形を格納します、TwelveOrLessプロパティラッパーによって実装されるのと同じ “小さい” の定義を使います：

source: Here’s a variation of the greet(person:) function that takes a person’s name and hometown and returns a greeting:
ja: ここにgreet(person:)関数の変形があります、それはある個人の名前と出身地をとって挨拶を返します：

source: Here’s a version of the greet(person:) function, which prints its own String value rather than returning it:
ja: ここにgreet(person:)関数の改作があります、それはString値を自身で出力します、それを返すのではなく：

source: Here’s a version of the Snakes and Ladders game originally introduced in Control Flow.
ja: 制御の流れで元々は紹介されるヘビとはしごゲームのひとつの改作が、ここにあります。

source: Here’s a version of the nongeneric IntStack type from Generic Types above, adapted to conform to the Container protocol:
ja: ここに、上の総称体型からの非総称体IntStack型の改作、Containerプロトコルに準拠するために適応させたものがあります：

source: Here’s an alternative version of the Rect structure that takes advantage of this shorthand notation:
ja: ここにRect構造体の代替のバージョンがあります、それはこの短縮形表記法を利用します：

source: Here’s an another version of the Rect structure that takes advantage of this shorthand notation and the shorthand notation for setters:
ja: ここにRect構造体の別のバージョンがあります、それはこの省略形表記法とセッターに対する省略形表記法を利用します：

source: Here’s an example for the four main points of a compass:
ja: ここに、コンパスの主な４方位のための例があります：

source: Here’s an example of makeIncrementer in action:
ja: 動作しているmakeIncrementerの例がここにあります：

source: Here’s an example of willSet and didSet in action.
ja: willSetとdidSetの作動する例が、ここにあります。

source: Here’s an example of a deinitializer in action.
ja: デイニシャライザの動作の例は、ここにあります。

source: Here’s an example of a function called makeIncrementer, which contains a nested function called incrementer.
ja: ここに、makeIncrementerと呼ばれる関数の例があります、それはincrementerと呼ばれる入れ子にされた関数を含みます。

source: Here’s an example of a function called swapTwoInts(_:_:), which has two in-out integer parameters called a and b:
ja: ここにswapTwoInts(_:_:)と呼ばれる関数の例があります、それは、aとbと呼ばれる２つのin-out整数パラメータを持ちます：

source: Here’s an example of a function that incorporates its type parameter into the underlying type of the value it returns:
ja: ここに、ある関数の例があります、それはそれの型パラメータを、それが返す値のその基礎をなす型へと組み入れます。

source: Here’s an example of a protocol called Container, which declares an associated type called Item:
ja: Containerと呼ばれるプロトコルの例がここにあります、それはItemと呼ばれる関連型を宣言します：

source: Here’s an example of a protocol that inherits the TextRepresentable protocol from above:
ja: 上のTextRepresentableプロトコルを継承するプロトコルの例は、ここにあります：

source: Here’s an example of a protocol used as a type:
ja: 型として使われるプロトコルの例は、ここにあります：

source: Here’s an example of a protocol with a single instance property requirement:
ja: ただ１つのインスタンスプロパティ要件を持つプロトコルの例が、ここにあります：

source: Here’s an example of a read-only subscript implementation, which defines a TimesTable structure to represent an n-times-table of integers:
ja: ここに読み出し専用の添え字の実施の例があります、それは、整数の九九のn段を表すTimesTable構造体を定義します：

source: Here’s an example of a simple structure that adopts and conforms to the FullyNamed protocol:
ja: FullyNamedプロトコルを採用して準拠する単純な構造体の例は、ここにあります：

source: Here’s an example of a structure definition and a class definition:
ja: 構造体定義とクラス定義の例は、ここにあります：

source: Here’s an example of how Automatic Reference Counting works.
ja: 自動参照カウントがどのように働くかの例は、ここにあります。

source: Here’s an example of how a strong reference cycle can be created by accident.
ja: 強い参照循環がどのように偶然に作られることができるかの例は、ここにあります。

source: Here’s an example of how constants and variables can be used to track the number of login attempts a user has made:
ja: ここに定数と変数が、どのようにあるユーザーが行ったログインの試みの数を追跡するために使われることができるかの例があります：

source: Here’s an example of how error handling can be used to respond to different error conditions:
ja: ここにどのようにエラー処理が異なるエラー状態に応答するために使われることができるかの例があります：

source: Here’s an example of how optionals can be used to cope with the absence of a value.
ja: ここに、値の欠如に対処するためにどのようにオプショナルが使われることができるかの１つの例があります。

source: Here’s an example of this syntax for a while loop, although the principle is the same for all loops and switch statements:
ja: ここに、この構文のwhileループに対する例があります、とはいえその原則は全てのループとswitch文のための同じです：

source: Here’s an example of using Any to work with a mix of different types, including function types and nonclass types.
ja: 関数型と非クラス型を含む、異なった型の混合を扱うためにAnyを使う例が、ここにあります。

source: Here’s an example of what happens when an unsigned integer is allowed to overflow in the positive direction, using the overflow addition operator (&+):
ja: ここに、オーバフロー加算演算子（&+）を使用して、正の向きにおいて符号なし整数がオーバフローを許されるとき何が起こるかの例があります：

source: Here’s an example that combines the Named protocol from the previous example with a Location class:
ja: ここに１つの例があります、それは前の例からのNamedプロトコルをLocationクラスと結び付けます：

source: Here’s an example that combines two protocols called Named and Aged into a single protocol composition requirement on a function parameter:
ja: ここに、関数パラメータ上でNamedとAgedと呼ばれる２つのプロトコルを１つのプロトコル合成要件に結合する例があります：

source: Here’s an example that defines a simple Counter class, which can be used to count the number of times an action occurs:
ja: 単純なCounterクラスを定義する例がここにあります、それは、ある動作が起こる回数を数えるために使われることができます：

source: Here’s an example that stores raw ASCII values alongside named enumeration cases:
ja: 指定した列挙ケース節の傍らに生のASCII値を格納する例は、ここにあります：
